In [63]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          566                 49
1        UAS1         Fisika                          780                 55
2        UTS2         Fisika                          769                 84
3        UAS2         Fisika                          343                 53
4        UTS1     Matematika                          689                 63
5        UAS1     Matematika                          377                 81
6        UTS2     Matematika                          318                 73
7        UAS2     Matematika                          791                 99
8        UTS1     Statistika                          664                 73
9        UAS1     Statistika                          590                 94
10       UTS2     Statistika                          573                 51
11       UAS2     Statistika                          782                 71



---



---

## Soal 1. Data Cleaning

Lakukan sorting data berdasarkan Rata2 nilai ujian dari terbesar ke terkecil

*   Lakukan sorting data berdasarkan Rata2 nilai ujian dari terbesar ke terkecil
*   Tipe Ujian dan Mata pelajaran apakah yang memiliki rata2 nilai terkecil?

In [20]:
#code here
df.sort_values('Rata2 Nilai Ujian', ascending=False)
pivot_min = pd.pivot_table(df, index='Tipe Ujian',columns='Mata Pelajaran' , values='Rata2 Nilai Ujian')
pivot_min.min()

Mata Pelajaran
Fisika        45
Matematika    53
Statistika    50
dtype: int64

In [66]:
df.sort_values('Rata2 Nilai Ujian', ascending=True)
df.min()

Tipe Ujian                       UAS1
Mata Pelajaran                 Fisika
Rata2 Waktu Belajar (menit)       318
Rata2 Nilai Ujian                  49
dtype: object

<h2>Soal 2: Data Restructuring</h2>

Jelaskan itu pivoting dan melting data



---

pivoting = suatu pengubahan bentuk data dengan memutar data yang terletak di baris menjadi column 

melting data = kebalikan dari pivotingi ( unpivoting ) mengubah yang tadinya column menjadi posisi row

---

<h2>Soal 3: Reshaping Data 1</h2>

In [60]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          315                 69
1        UAS1         Fisika                          558                 99
2        UTS2         Fisika                          713                 90
3        UAS2         Fisika                          599                 69
4        UTS1     Matematika                          221                 74
5        UAS1     Matematika                          432                 66
6        UTS2     Matematika                          584                 56
7        UAS2     Matematika                          564                 62
8        UTS1     Statistika                          503                 98
9        UAS1     Statistika                          232                 63
10       UTS2     Statistika                          205                 54
11       UAS2     Statistika                          645                 85

Perhatikan data di atas, kemudian ubahlah bentuknya agar sesuai yang di harapkan.

In [61]:
#code here
pivot_table = pd.pivot(df , index='Tipe Ujian', columns = 'Mata Pelajaran' , values=['Rata2 Nilai Ujian','Rata2 Waktu Belajar (menit)'])
pivot_table

               Rata2 Nilai Ujian                        \
Mata Pelajaran            Fisika Matematika Statistika
Tipe Ujian
UAS1                          99         66         63
UAS2                          69         62         85
UTS1                          69         74         98
UTS2                          90         56         54

               Rata2 Waktu Belajar (menit)
Mata Pelajaran                      Fisika Matematika Statistika
Tipe Ujian
UAS1                                   558        432        232
UAS2                                   599        564        645
UTS1                                   315        221        503
UTS2                                   713        584        205

Expected Result:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1XufsfqZe7-XZLsb92SpATexy-QRZE0ow)



---



---

<h2>Soal 4: Reshaping Data 2</h2>

In [7]:
import pandas as pd

data = {
    'Hari' : ['Sabtu', 'Minggu'],
    'Kebun Binatang' : [271, 399],
    'Dufan' : [501, 700],
    'Disney' : [1000, 1001],
    'Bali' : [900, 803]
}
df = pd.DataFrame(data).set_index('Hari')
df

        Kebun Binatang  Dufan  Disney  Bali
Hari
Sabtu              271    501    1000   900
Minggu             399    700    1001   803

diatas adalah data tentang jumlah pengunjung di berbagai tempat hiburan, ubahlah struktur data tersebut sehingga sesuai dengan hasil yang diharapkan.

In [50]:
#code here

melt = df.reset_index()
pd.melt(melt, id_vars =['Hari'],value_vars=['Kebun Binatang','Dufan','Disney','Bali'] )

     Hari        variable  value
0   Sabtu  Kebun Binatang    271
1  Minggu  Kebun Binatang    399
2   Sabtu           Dufan    501
3  Minggu           Dufan    700
4   Sabtu          Disney   1000
5  Minggu          Disney   1001
6   Sabtu            Bali    900
7  Minggu            Bali    803

Expected Result:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=159mIqcyfeD30EEcyZmmkovORa6cZDLtn)



---



---

<h2>Soal 5: Data Enrichment</h2>

Lakukan binning data menggunakan qcut sehingga sesuai hasil yang diharapkan

In [57]:
#code here
labels = ['lulus','tidak lulus','remedial']
df['kelulusan'] = pd.qcut(df['Rata2 Nilai Ujian'],q=3 , labels=labels)
df

,Tipe Ujian,Mata Pelajaran,Rata2 Waktu Belajar (menit),Rata2 Nilai Ujian,kelulusan
0,UTS1,Fisika,321,65,tidak lulus
1,UAS1,Fisika,661,57,lulus
2,UTS2,Fisika,562,92,remedial
3,UAS2,Fisika,273,93,remedial
4,UTS1,Matematika,797,79,tidak lulus
5,UAS1,Matematika,579,57,lulus
6,UTS2,Matematika,520,73,tidak lulus
7,UAS2,Matematika,449,47,lulus
8,UTS1,Statistika,578,53,lulus
9,UAS1,Statistika,729,85,remedial
10,UTS2,Statistika,456,85,remedial
11,UAS2,Statistika,513,56,lulus

Expected Output:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1h2_u5_xhD1_QtPpItTj-o3lljHhnr4XS)



---



---